## 데이터베이스의 종류와 특징

### 1. 데이터베이스 (DB) 란?

* 여러 사람이 공유할 목적으로 통합 관리하기 위해 논리적으로 연관된 데이터를 모아 일정한 형태로 저장해 놓은 것
* 여러 시스템 또는 사용자들이 공용 할 목적으로 통합 저장한 데이터의 집합

### 2. 데이터베이스의 목적

* **ISOS**:*
    * 통합된 데이터 (Integrated Data)
    * 저장된 데이터 (Stored Data)
    * 운영 데이터 (Operational Data)
    * 공유 데이터 (Shared Data)
* **R1C3**:*
    * 실시간 접근성 (Real-time Accessibility)
    * 지속적인 변화 (Continuous Evolution)
    * 동시 공유 (Concurrent Sharing)
    * 내용에 의한 참조 (Content-based Reference)

### 3. 데이터베이스 관리 시스템 (DBMS) 란?

* 데이터 입력, 수정, 삭제 등의 기능을 제공하는 별도의 소프트웨어

### 4. 데이터베이스의 종류

#### 4.1. 계층형 데이터베이스 (Hierarchical Database)

* 데이터가 부모와 자식 관계인 트리 구조
* 데이터 중복이 발생하기 쉬움
* 데이터는 상하 종속 관계이므로 초기 설계 변경이 어려워 현재는 거의 사용하지 않음

#### 4.2. 네트워크형 데이터베이스 (Network Database)

* 데이터를 노드로 표현한 모델
* 네트워크상에 있으며 서로 대등한 관계
* 계층형 데이터베이스의 단점인 데이터 중복 문제, 상하 종속 관계를 해결했지만 구조가 복잡하여 변경, 운영이 어렵고 데이터 종속성 문제가 있음

#### 4.3. 키-값 데이터베이스 (Key-Value Database)

* NoSQL의 한 종류로, 키-값을 일대일 대응해 데이터를 저장
* 데이터 중복이 발생하며 비정형 데이터 저장에 유리
* 관계형 데이터베이스와 함께 가장 많이 사용
* 스키마 없이 작동하므로 비정형 데이터를 쉽게 저장할 수 있음

#### 4.4. 관계형 데이터베이스 (Relational Database)

* 실무에서 가장 많이 사용하는 데이터베이스
* 데이터를 테이블 형태로 저장
* 기본키 (Primary Key)가 각 행을 식별
* 데이터는 행 (Row) 단위로 저장
* 각 항목의 속성은 열 (Column)이라고 표현
* 저장된 집합은 테이블 (Table)이라고 함

#### 4.5. NoSQL 데이터베이스 (NoSQL Database)

* 키-값 데이터베이스 (Key-Value Database)
* 문서 데이터베이스 (Document Database)
* 컬럼 데이터베이스 (Column Database)
* 그래프 데이터베이스 (Graph Database)

### 5. 관계형 데이터베이스의 구조

* **열 (Column)**: 각 열은 고유한 이름을 가지며 자신만의 타입을 가지고 있음 (필드 또는 애트리뷰트라고도 함)
* **행 (Row)**: 관계된 데이터의 묶음을 의미하며 한 테이블의 모든 행은 같은 수의 열을 가지고 있음 (튜플 또는 레코드라고도 함)
* **테이블 (Table)**: 행과 열 값들의 모음을 나타내는 것으로, 도메인 특성에 따라 데이터를 논리적으로 그룹화하여 모아 놓은 것

### 6. 엑셀, 스프레드시트와 DB의 차이

* DB와 달리 열 이름이 정의되지 않기 때문에 1행에 열 이름을 명시해야 함

### 7. ERD (Entity Relationship Diagram)

* 테이블 간의 관계를 표현한 그림
* 논리 모델: 데이터 모델의 첫 단계로 고객의 요구 사항을 수집 분석해 데이터베이스의 전체 모양을 구성
* 물리 모델: 논리 모델을 바탕으로 실제 데이터를 저장할 수 있는 모델을 표현

### 8. SQL 문법의 종류

* **DDL (Data Definition Language, 데이터 정의 언어)**:*
    * `CREATE` (생성)
    * `ALTER` (수정)
    * `DROP` (삭제)
    * `TRUNCATE` (잘라내기)
* **DML (Data Manipulation Language, 데이터 조작 언어)**:*
    * `SELECT` (조회)
    * `INSERT` (삽입)
    * `UPDATE` (수정)
    * `DELETE` (삭제)
* **DCL (Data Control Language, 데이터 제어 언어)**:*
    * `GRANT` (권한 부여)
    * `REVOKE` (권한 회수)
    * `COMMIT` (트랜잭션 확정)
    * `ROLLBACK` (트랜잭션 취소)
